#include <SFML/Graphics.hpp>
#include <iostream>

const int map_const = 21;

sf::String tile_map[map_const] = {
	" [--------#--------] ",
	" |........|.......2| ",
	" |.<>.<->.v.<->.<>.| ",
	" |.................| ",
	" |.<>.^.<-#->.^.<>.| ",
	" |....|...|...|....| ",
	" \\--].}-> v <-{.[--/ ",
	"    |.|       |.|    ",
	"----/.v [> <] v.\\----",
	"     .  |   |  .     ",
	"----].^ \\---/ ^.[----",
	"    |.|       |.|    ",
	" [--/.v <-#-> v.\\--] ",
	" |........|........| ",
	" |.<].<->.v.<->.[>.| ",
	" |..|...........|..| ",
	" }>.v.^.<-#->.^.v.<{ ",
	" |....|...|...|....| ",
	" |.<--@->.v.<-@-->.| ",
	" |2...............2| ",
	" \\-----------------/ "
};
int logic_map[map_const][map_const] = {
		{ 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0 },
		{ 0, 1, 2, 0, 0, 2, 0, 0, 0, 2, 1, 2, 0, 0, 0, 2, 0, 0, 2, 1, 0 },
		{ 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0 },
		{ 0, 1, 2, 0, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 0, 2, 1, 0 },
		{ 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0 },
		{ 0, 1, 2, 0, 0, 2, 1, 2, 0, 2, 1, 2, 0, 2, 1, 2, 0, 0, 2, 1, 0 },
		{ 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 0 },
		{ 0, 0, 0, 0, 1, 0, 1, 2, 0, 2, 0, 2, 0, 2, 1, 0, 1, 0, 0, 0, 0 },
		{ 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1 },
		{ 0, 0, 0, 0, 0, 2, 0, 2, 1, 0, 0, 0, 1, 2, 0, 2, 0, 0, 0, 0, 0 },
		{ 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1 },
		{ 0, 0, 0, 0, 1, 0, 1, 2, 0, 0, 0, 0, 0, 2, 1, 0, 1, 0, 0, 0, 0 },
		{ 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0 },
		{ 0, 1, 2, 0, 0, 2, 0, 2, 0, 2, 1, 2, 0, 2, 0, 2, 0, 0, 2, 1, 0 },
		{ 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0 },
		{ 0, 1, 2, 2, 1, 2, 0, 2, 0, 2, 0, 2, 0, 2, 0, 2, 1, 2, 2, 1, 0 },
		{ 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0 },
		{ 0, 1, 2, 2, 0, 2, 1, 2, 0, 2, 1, 2, 0, 2, 1, 2, 0, 2, 2, 1, 0 },
		{ 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0 },
		{ 0, 1, 2, 0, 0, 0, 0, 0, 0, 2, 0, 2, 0, 0, 0, 0, 0, 0, 2, 1, 0 },
		{ 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0 }
};

/*
Евгений Ваганович Сартр, иди нах*й, если
У тебя нет внятного объяснения этим действиям:
Зачем люди закладывали динамитные шашки в рот,
Диском циркулярки вспарывали свой живот,
Прознали иглой или ржавым штопором башку,
Себе в глотку запихивали раскаленную кочергу,
Залезали на дерево, заедали яд глиной,
Стрелялись гибридом ружья и швейной машины.


Жан-Поль Петросян, иди в п*зду, если не знаешь
Ответа, зачем мужчины и женщины делали это:
Сжимали в объятиях раскаленные камины,
Отрубали себе голову самодельной гильотиной,
Прыгали в плавленное стекло и жерло вулкана,
Извлекали свои внутренности вязальными крюками,
Распинали себя на кресте и из жизни уходили,
Страстно мечтая всего лишь проснуться живыми.
*/