#include < stdio.h >  // Для printf
#include < string.h > // Для strcpy
#include < locale.h >  // Для printf


int main()
{
	srand(time(NULL));
	setlocale(LC_ALL, "Russian");
	char dst[50] = "";

	char n1[20][10] = { "Диб", "Вор", "Ро", "Гал", "Фла", "Ба", "Ваз", "Дор", "Ид", "Кри", "Кеф", "Оки", "Ол", "Орф", "Фур", "Мар", "Сат", "Три", "Ре", "Ино" };//15
	char n2[11][10] = { "ел", "ти", "ла", "ери", "ви", "йо", "или", "иу", "ум", "зе", "ало", };
	char n3[10][10] = { " ", "гонт", "нд", "ий", "н", "с", "н", "г", "б", "р" };

	char nn1[15][10] = { "Ара", "Атэ", "Гли", "Дай", "Кас", "Ки", "Мар", "Мел", "Нэй", "Офе", "Соф", "Эле", "Але", "Эми", "Эй", };//женщины
	char nn2[9][10] = { "х", "н", "кер", "о", "ан", "гари", "ис", "та", "фтэ", };//женщины
	char nn3[9][10] = { "на", "ия", "дра", "ис", "ния", "тес", "а", "са", "рия" };//женщины

	// Копируем строку из массива src в массив dst. Обратите внимание, 
	int r,b;
	for (int i = 0; i < 40; i++){
		b = rand() % 3 + 1;
		if (b != 1){
			r = rand() % 20;
			strcpy_s(dst, 50, n1[r]);
			r = rand() % 11;
			strcat_s(dst, 50, n2[r]);
			r = rand() % 10;
			strcat_s(dst, 50, n3[r]);
			printf("Имя: (мужское) %s\n", dst);
		}
		else{
			r = rand() % 15;
			strcpy_s(dst, 50, nn1[r]);
			r = rand() % 9;
			strcat_s(dst, 50, nn2[r]);
			r = rand() % 9;
			strcat_s(dst, 50, nn3[r]);
			printf("Имя: (женское) %s\n", dst);
		}
	}
	getch();
	return 0;
}